# ETL Project

In [2]:
#Dependencies
import pandas as pd
from sqlalchemy import create_engine

## Extract CSVs into DataFrame

In [4]:
#Read in top250 file and view dataframe 
top250_file = "data/Top250.csv"
top250 = pd.read_csv(top250_file)
top250.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [5]:
#Read in future50 file and view dataframe 
future50_file = "data/Future50.csv"
future50 = pd.read_csv(future50_file)
future50.head()

,Rank,Restaurant,Location,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [6]:
#Read in Independence100 file and view dataframe 
ind100_file = "data/Independence100.csv"
ind100 = pd.read_csv(ind100_file)
ind100.head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0

## Transform DataFrames

In [6]:
#Drop any null values

#Rename any columns

#Make the Sales units match across tables

### Join Future50 and Ind100 on location

In [53]:
# Step 1. Make a copy of Future 50 df
future50_df = future50.copy()
future50_df.head()

,Rank,Restaurant,Location,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [54]:
# Step 2 Split Future50 Locations into cities and states columns into a new df
future50_split = future50_df["Location"].str.split(",", n = 1, expand = True)
future50_split.head()

                  0        1
0           Seattle    Wash.
1         Charlotte     N.C.
2  Huntington Beach   Calif.
3        Wilmington     N.C.
4            Irvine   Calif.

In [51]:
# Step 3 Create City and State columns on existing future50_df then drop the Location column
future50_df["City"]= future50_split[0]
future50_df["State"]= future50_split[1]
future50_df = future50_df.drop(columns = ['Location', 'YOY_Sales', 'Units', 'YOY_Units', 'Unit_Volume', 'Franchising' ])
#future50_df = future50_df['Sales']*1000000
future50_df.head()

0    24000000
1    44000000
2    21000000
3    25000000
4    49000000
Name: Sales, dtype: object

In [28]:
# Step 3 Drop unnecessary columns from ind100 and create a new df
ind100_df = ind100.drop(columns = ['Average Check', 'Meals Served'])
ind100_df.head()

   Rank                           Restaurant       Sales        City State
0     1             Carmine's (Times Square)  39080335.0    New York  N.Y.
1     2                The Boathouse Orlando  35218364.0    Orlando   Fla.
2     3                     Old Ebbitt Grill  29104017.0  Washington  D.C.
3     4  LAVO Italian Restaurant & Nightclub  26916180.0    New York  N.Y.
4     5             Bryant Park Grill & Cafe  26900000.0    New York  N.Y.

In [37]:
# Step 4 Merge Future50 and Ind100 on State
#location_df = pd.merge(future50_df, ind100_df, on="Restaurant", how='right')
location_df = pd.concat([future50_df, ind100_df], axis=0)
location_df

    Rank              Restaurant       Sales              City    State
0      1              Evergreens        24.0           Seattle    Wash.
1      2             Clean Juice        44.0         Charlotte     N.C.
2      3                Slapfish        21.0  Huntington Beach   Calif.
3      4              Clean Eatz        25.0        Wilmington     N.C.
4      5               Pokeworks        49.0            Irvine   Calif.
..   ...                     ...         ...               ...      ...
95    96    George's at the Cove  12194000.0          La Jolla   Calif.
96    97               Le Coucou  12187523.0          New York     N.Y.
97    98                 Mi Vida  12032014.0        Washington     D.C.
98    99                  Upland  11965564.0          New York     N.Y.
99   100  Virgil's Real Barbecue  11391678.0         Las Vegas     Nev.

[150 rows x 5 columns]

In [ ]:
#Aggregate Ind100 by summing (sales or meals) to find overall top

#Grouby Restaurant, summing by (sales or meals)

#Set rank to index

#Reset index to show new rank

## Load DataFrames into Database

In [38]:
# Import pgadmin password from python file
from etlpw import pw

In [39]:
# Create Database Connection
engine = create_engine(f'postgresql://postgres:{pw}@localhost:5432/restaurant_db')
#engine = create_engine(f'postgresql://{connection_string}')

In [40]:
# Confirm tables
engine.table_names()

['future50', 'ind100', 'top250', 'location']

In [41]:
# Add dataframes to sql for Future 50 df.
future50.to_sql(name='future50', con=engine, if_exists='append', index=False)

In [42]:
# Add dataframes to sql for ind100 df.
ind100.to_sql(name='ind100', con=engine, if_exists='append', index=False)

In [43]:
# Add dataframes to sql for top250 df.
top250.to_sql(name='top250', con=engine, if_exists='append', index=False)

In [45]:
# Add dataframes to sql for location df.
location_df.to_sql(name='location', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_location table

In [46]:
pd.read_sql_query('select * from location', con=engine)

     Rank              Restaurant       Sales              City    State
0       1              Evergreens        24.0           Seattle    Wash.
1       2             Clean Juice        44.0         Charlotte     N.C.
2       3                Slapfish        21.0  Huntington Beach   Calif.
3       4              Clean Eatz        25.0        Wilmington     N.C.
4       5               Pokeworks        49.0            Irvine   Calif.
..    ...                     ...         ...               ...      ...
145    96    George's at the Cove  12194000.0          La Jolla   Calif.
146    97               Le Coucou  12187523.0          New York     N.Y.
147    98                 Mi Vida  12032014.0        Washington     D.C.
148    99                  Upland  11965564.0          New York     N.Y.
149   100  Virgil's Real Barbecue  11391678.0         Las Vegas     Nev.

[150 rows x 5 columns]